# Use LEAD_CONV_Snowpark38_XL Notebook template

In [1]:
from snowflake.snowpark import Session
from snowflake.connector.pandas_tools import write_pandas

# Data Science Libs
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# create_temp_table warning suppresion
import warnings; warnings.simplefilter('ignore')

Matplotlib created a temporary cache directory at /tmp/matplotlib-83wi05gj because the default path (/home/mosaic-ai/.cache/matplotlib) is not a writable directory; it is highly recommended to set the MPLCONFIGDIR environment variable to a writable directory, in particular to speed up the import of Matplotlib and to better support multiprocessing.

In [2]:
from fosforio import snowflake

Connection manager service url initialised to http://fdc-project-manager:80/project-manager
If you need to update its value then update the variable CONNECTION_MANAGER_BASE_URL in os env.

In [3]:
# To get snowflake connection object with a default snowflake connection created by the user, if available.
snowflake.get_connection()

User name picked from OS env: manishh.singh@fosfor.com
Fetching connections created by manishh.singh@fosfor.com user
Connection names fetched ['FDC_SNOWFLAKE', 'FDC_SNOWFLAKE', 'FDC_SNOWFLAKE', 'FDC_Insurance_Snowflake', 'FDC_Banking_FS_Snowflake', 'FDC_Banking_FS_Snowflake', 'FDC_Insurance_Snowflake', 'BFS_LEAD_CONV_CXN'], created by manishh.singh@fosfor.com
Exception occurred in getting snowflake connection: 'connectionSources'

# TRANSACTIONS data

In [4]:
# To read a specific dataset published from a snowflake connection
df = snowflake.get_dataframe("TRANSACTIONS")

In [5]:
df.shape

(227894, 14)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227894 entries, 0 to 227893
Data columns (total 14 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   ID                  227894 non-null  object
 1   LEAD_CREATION_DATE  227894 non-null  object
 2   MONTH               227894 non-null  int8
 3   YEAR                227894 non-null  int16
 4   QUARTER             227894 non-null  int8
 5   MOBILE_VERIFIED     227894 non-null  object
 6   FILLED_FORM         227894 non-null  object
 7   DEVICE_TYPE         227894 non-null  object
 8   VAR2                227894 non-null  object
 9   SOURCE              227894 non-null  object
 10  VAR4                227894 non-null  float64
 11  VAR5                227894 non-null  int8
 12  VAR1                227894 non-null  object
 13  DISBURSED           227894 non-null  float64
dtypes: float64(2), int16(1), int8(3), object(8)
memory usage: 18.5+ MB

In [8]:
df.describe()

,MONTH,YEAR,QUARTER,VAR4,VAR5,DISBURSED
count,227894.000000,227894.000000,227894.000000,227894.000000,227894.000000,227894.000000
mean,6.393051,2023.225056,2.464949,3.502067,7.792048,0.365025
std,3.074755,0.830456,1.012503,1.917322,6.433960,0.481438
min,1.000000,2022.000000,1.000000,0.000000,0.000000,0.000000
25%,4.000000,2022.000000,2.000000,2.000000,0.000000,0.000000
50%,6.000000,2023.000000,2.000000,3.000000,10.000000,0.000000
75%,9.000000,2024.000000,3.000000,5.000000,14.000000,1.000000
max,12.000000,2024.000000,4.000000,7.000000,18.000000,1.000000

In [9]:
df.describe(include='O')

,ID,LEAD_CREATION_DATE,MOBILE_VERIFIED,FILLED_FORM,DEVICE_TYPE,VAR2,SOURCE,VAR1
count,227894,227894,227894,227894,227894,227894,227894,227894
unique,218989,1143,2,2,2,7,27,19
top,ID000536b56,18/7/1924,Y,N,Web-browser,B,S122,HBXX
freq,4,1050,167948,130736,139174,67674,33264,148638

In [10]:
df.isnull().sum()

ID                    0
LEAD_CREATION_DATE    0
MONTH                 0
YEAR                  0
QUARTER               0
MOBILE_VERIFIED       0
FILLED_FORM           0
DEVICE_TYPE           0
VAR2                  0
SOURCE                0
VAR4                  0
VAR5                  0
VAR1                  0
DISBURSED             0
dtype: int64

# LOAN_DETAILS data

In [11]:
# To read a specific dataset published from a snowflake connection
df = snowflake.get_dataframe("LOAN_DETAILS")

In [12]:
df.shape

(227894, 4)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227894 entries, 0 to 227893
Data columns (total 4 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   227894 non-null  object
 1   LOAN_AMOUNT_APPLIED  227838 non-null  float64
 2   LOAN_TENURE_APPLIED  227838 non-null  float64
 3   EXISTING_EMI         227838 non-null  float64
dtypes: float64(3), object(1)
memory usage: 7.0+ MB

In [14]:
df.describe()

       LOAN_AMOUNT_APPLIED  LOAN_TENURE_APPLIED   EXISTING_EMI
count         2.278380e+05        227838.000000  227838.000000
mean          6.200035e+05             3.090608      87.187609
std           3.574560e+05             0.849575     498.790665
min           4.000000e-02             0.000000       0.000000
25%           5.000000e+05             3.000000       0.000000
50%           8.000000e+05             3.000000       0.000000
75%           8.000000e+05             3.000000     132.000000
max           6.000000e+06            10.000000  200000.000000

In [15]:
df.describe(include='O')

                 ID
count        227894
unique       218989
top     ID000235c85
freq              4

In [16]:
df.isnull().sum()

ID                      0
LOAN_AMOUNT_APPLIED    56
LOAN_TENURE_APPLIED    56
EXISTING_EMI           56
dtype: int64

# INCOME_DETAILS data

In [17]:
# To read a specific dataset published from a snowflake connection
df = snowflake.get_dataframe("INCOME_DETAILS")

In [18]:
df.shape

(227894, 4)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227894 entries, 0 to 227893
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   ID              227894 non-null  object
 1   MONTHLY_INCOME  227894 non-null  float64
 2   EMPLOYER_NAME   227894 non-null  object
 3   SALARY_ACCOUNT  227894 non-null  object
dtypes: float64(1), object(3)
memory usage: 7.0+ MB

In [20]:
df.describe()

       MONTHLY_INCOME
count    2.278940e+05
mean     1.137492e+03
std      7.977911e+03
min      0.000000e+00
25%      8.390000e+02
50%      1.046533e+03
75%      1.284002e+03
max      2.402003e+06

In [21]:
df.describe(include='O')

                 ID EMPLOYER_NAME SALARY_ACCOUNT
count        227894        227894         227894
unique       218989            98             35
top     ID000235c85         Adobe   Bank of Hope
freq              4          4939          62635

In [22]:
df.isnull().sum()

ID                0
MONTHLY_INCOME    0
EMPLOYER_NAME     0
SALARY_ACCOUNT    0
dtype: int64

# DEMOGRAPHICS_DETAILS data

In [23]:
# To read a specific dataset published from a snowflake connection
df = snowflake.get_dataframe("DEMOGRAPHICS_DETAILS")

In [24]:
df.shape

(227894, 6)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227894 entries, 0 to 227893
Data columns (total 6 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      227894 non-null  object
 1   GENDER  227894 non-null  object
 2   DOB     227894 non-null  object
 3   CITY    227894 non-null  object
 4   STATE   227894 non-null  object
 5   AGE     227894 non-null  int8
dtypes: int8(1), object(5)
memory usage: 8.9+ MB

In [26]:
df.describe()

                 AGE
count  227894.000000
mean       35.199562
std         6.404504
min        25.000000
25%        30.000000
50%        35.000000
75%        40.000000
max       100.000000

In [27]:
df.describe(include='O')

                 ID  GENDER         DOB      CITY       STATE
count        227894  227894      227894    227894      227894
unique       218989       2       11842       686          51
top     ID000940Y90    Male  11/11/1989  New York  California
freq              4  151955         305     41412       84204

In [28]:
df.isnull().sum()

ID        0
GENDER    0
DOB       0
CITY      0
STATE     0
AGE       0
dtype: int64